meeting/agenda/2025/11-25.org
:PROPERTIES:
:ID:       26D840A3-7D3F-40AC-B280-412906645D77
:END:
#+title: QT4 CG Meeting 143 Agenda 2025-11-25
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/11-18.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 25 November 2025.

The next meeting is planned for 2 December 2025.

Looking forward, the chair proposes that we meet on 2, 9, and 16 December, then
recess for the end-of-year holidays, with the following meeting on
6 January 2026.

Comments?

** Review of open action items [0/4]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-140-02: MK to add a note about dealing with binary in parse-csv and parse-json
+ [ ] QT4CG-141-01: MK to follow up on a comment by JWL on #2269
+ [ ] QT4CG-142-01: MK to review the “Captured Groups within Lookahead” example.
+ [ ] QT4CG-142-02: MK to add explanatory note about the difference between typed an untyped values in string-length

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2309][#2309]]: Allow SimpleMapExpr after ArrowExpr
+ PR [[https://qt4cg.org/dashboard/#pr-2266][#2266]]: 540 system-property equivalent for XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-2256][#2256]]: 2216 All atomic types become ordered
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2124][#2124]]: 573 Functions to Construct Trees
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2308][#2308]]: QT4CG-140-02 Add note about binary input to parse-csv and parse-json
+ PR [[https://qt4cg.org/dashboard/#pr-2306][#2306]]: QT4CG-141-01 Fix formal equivalent of array:for-each
+ PR [[https://qt4cg.org/dashboard/#pr-2304][#2304]]: QT4CG-142-02: Add notes on gotchas for string-length and normalize-space
+ PR [[https://qt4cg.org/dashboard/#pr-2303][#2303]]: 2195 Fix some more simple editorial errors
+ PR [[https://qt4cg.org/dashboard/#pr-2296][#2296]]: 2288 XSLT implicit document nodes

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2291][#2291]]: load-xquery-module: formalizing (loading-)parameters
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2287][#2287]]: Ordered maps break JSON interoperability

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2301][#2301]]: 2198 Add cdata attribute to xsl:text and xsl:value-of
+ PR [[https://qt4cg.org/dashboard/#pr-2296][#2296]]: 2288 XSLT implicit document nodes
+ PR [[https://qt4cg.org/dashboard/#pr-2289][#2289]]: 2195 (partial) Editorial notes (incremental)
+ PR [[https://qt4cg.org/dashboard/#pr-2283][#2283]]: 2276 Relax XSLT rules on Extension Attributes
+ PR [[https://qt4cg.org/dashboard/#pr-2282][#2282]]: 2278 Add function bin:infer-encoding; simplify bin:decode-string
+ PR [[https://qt4cg.org/dashboard/#pr-2281][#2281]]: 2280 Usability of xsl:array-member
+ PR [[https://qt4cg.org/dashboard/#pr-2274][#2274]]: 407 Function items capturing XSLT context components
+ PR [[https://qt4cg.org/dashboard/#pr-2259][#2259]]: 938 Canonical serialization
+ PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]]: 2047 External resources and security
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2282: 2278 Add function bin:infer-encoding; simplify bin:decode-string
:PROPERTIES:
:CUSTOM_ID: pr-2282
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2282][#2282]]

Discussion continues from last week, please see also [[https://qt4cg.org/meeting/minutes/2025/11-18.html#pr-2282][that discussion]].

** PR #2289: 2195 (partial) Editorial notes (incremental)
:PROPERTIES:
:CUSTOM_ID: pr-2289
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2289][#2289]]
** PR #2259: 938 Canonical serialization
:PROPERTIES:
:CUSTOM_ID: pr-2259
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2259][#2259]]
** PR #2213: 2047 External resources and security
:PROPERTIES:
:CUSTOM_ID: pr-2213
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]]
** PR #2301: 2198 Add cdata attribute to xsl:text and xsl:value-of
:PROPERTIES:
:CUSTOM_ID: pr-2301
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2301][#2301]]
** PR #2296: 2288 XSLT implicit document nodes
:PROPERTIES:
:CUSTOM_ID: pr-2296
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2296][#2296]]
** PR #2283: 2276 Relax XSLT rules on Extension Attributes
:PROPERTIES:
:CUSTOM_ID: pr-2283
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2283][#2283]]
** PR #2281: 2280 Usability of xsl:array-member
:PROPERTIES:
:CUSTOM_ID: pr-2281
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2281][#2281]]
** PR #2274: 407 Function items capturing XSLT context components
:PROPERTIES:
:CUSTOM_ID: pr-2274
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2274][#2274]]
** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

