meeting/agenda/2025/11-25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 143 Agenda 2025-11-25</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 143 Agenda 2025-11-25</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/11-18.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 25 November 2025.
</p>

<p>
The next meeting is planned for 2 December 2025.
</p>

<p>
Looking forward, the chair proposes that we meet on 2, 9, and 16 December, then
recess for the end-of-year holidays, with the following meeting on
6 January 2026.
</p>

<p>
Comments?
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-140-02: MK to add a note about dealing with binary in parse-csv and parse-json</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-141-01: MK to follow up on a comment by JWL on #2269</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-142-01: MK to review the “Captured Groups within Lookahead” example.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-142-02: MK to add explanatory note about the difference between typed an untyped values in string-length</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2309">#2309</a>: Allow SimpleMapExpr after ArrowExpr</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2266">#2266</a>: 540 system-property equivalent for XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2256">#2256</a>: 2216 All atomic types become ordered</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2308">#2308</a>: QT4CG-140-02 Add note about binary input to parse-csv and parse-json</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2306">#2306</a>: QT4CG-141-01 Fix formal equivalent of array:for-each</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2304">#2304</a>: QT4CG-142-02: Add notes on gotchas for string-length and normalize-space</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2303">#2303</a>: 2195 Fix some more simple editorial errors</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2296">#2296</a>: 2288 XSLT implicit document nodes</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2291">#2291</a>: load-xquery-module: formalizing (loading-)parameters</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2287">#2287</a>: Ordered maps break JSON interoperability</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2301">#2301</a>: 2198 Add cdata attribute to xsl:text and xsl:value-of</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2296">#2296</a>: 2288 XSLT implicit document nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2289">#2289</a>: 2195 (partial) Editorial notes (incremental)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2283">#2283</a>: 2276 Relax XSLT rules on Extension Attributes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2282">#2282</a>: 2278 Add function bin:infer-encoding; simplify bin:decode-string</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2281">#2281</a>: 2280 Usability of xsl:array-member</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2274">#2274</a>: 407 Function items capturing XSLT context components</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2259">#2259</a>: 938 Canonical serialization</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>: 2047 External resources and security</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2282" class="outline-3">
<h3 id="pr-2282"><span class="section-number-3">2.1.</span> PR #2282: 2278 Add function bin:infer-encoding; simplify bin:decode-string</h3>
<div class="outline-text-3" id="text-pr-2282">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2282">#2282</a>
</p>

<p>
Discussion continues from last week, please see also <a href="https://qt4cg.org/meeting/minutes/2025/11-18.html#pr-2282">that discussion</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2289" class="outline-3">
<h3 id="pr-2289"><span class="section-number-3">2.2.</span> PR #2289: 2195 (partial) Editorial notes (incremental)</h3>
<div class="outline-text-3" id="text-pr-2289">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2289">#2289</a>
</p>
</div>
</div>
<div id="outline-container-pr-2259" class="outline-3">
<h3 id="pr-2259"><span class="section-number-3">2.3.</span> PR #2259: 938 Canonical serialization</h3>
<div class="outline-text-3" id="text-pr-2259">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2259">#2259</a>
</p>
</div>
</div>
<div id="outline-container-pr-2213" class="outline-3">
<h3 id="pr-2213"><span class="section-number-3">2.4.</span> PR #2213: 2047 External resources and security</h3>
<div class="outline-text-3" id="text-pr-2213">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>
</p>
</div>
</div>
<div id="outline-container-pr-2301" class="outline-3">
<h3 id="pr-2301"><span class="section-number-3">2.5.</span> PR #2301: 2198 Add cdata attribute to xsl:text and xsl:value-of</h3>
<div class="outline-text-3" id="text-pr-2301">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2301">#2301</a>
</p>
</div>
</div>
<div id="outline-container-pr-2296" class="outline-3">
<h3 id="pr-2296"><span class="section-number-3">2.6.</span> PR #2296: 2288 XSLT implicit document nodes</h3>
<div class="outline-text-3" id="text-pr-2296">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2296">#2296</a>
</p>
</div>
</div>
<div id="outline-container-pr-2283" class="outline-3">
<h3 id="pr-2283"><span class="section-number-3">2.7.</span> PR #2283: 2276 Relax XSLT rules on Extension Attributes</h3>
<div class="outline-text-3" id="text-pr-2283">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2283">#2283</a>
</p>
</div>
</div>
<div id="outline-container-pr-2281" class="outline-3">
<h3 id="pr-2281"><span class="section-number-3">2.8.</span> PR #2281: 2280 Usability of xsl:array-member</h3>
<div class="outline-text-3" id="text-pr-2281">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2281">#2281</a>
</p>
</div>
</div>
<div id="outline-container-pr-2274" class="outline-3">
<h3 id="pr-2274"><span class="section-number-3">2.9.</span> PR #2274: 407 Function items capturing XSLT context components</h3>
<div class="outline-text-3" id="text-pr-2274">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2274">#2274</a>
</p>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.10.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
